grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_host.h
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_BBERRM Babble error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_TXERRM Transaction error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_NYET response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK1_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz1 OTGHSHCTSIZ1 OTG_HS host channel-1 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ1_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz1_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsizsg1 OTGHSHCTSIZSG1 OTG host channel x transfer size register
@{*/

/** OTG_HS_HOST_OTG_HS_HCTSIZSG1_DOPNG Do ping **/
#define OTG_HS_HOST_OTG_HS_HCTSIZSG1_DOPNG		(1 << 31)

#define OTG_HS_HOST_OTG_HS_HCTSIZSG1_PID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZSG1_PID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsizsg1_pid PID PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG1_NTD_SHIFT		8
#define OTG_HS_HOST_OTG_HS_HCTSIZSG1_NTD_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg1_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG1_SCHED_INFO_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZSG1_SCHED_INFO_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg1_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma1 OTGHSHCDMA1 OTG_HS host channel-1 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA1_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA1_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma1_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdmasg1 OTGHSHCDMASG1 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMASG1_DMASG_SHIFT		3
#define OTG_HS_HOST_OTG_HS_HCDMASG1_DMASG_MASK		0x1fffffff
/** @defgroup otg_hs_host_otg_hs_hcdmasg1_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar2 OTGHSHCCHAR2 OTG_HS host channel-2 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR2_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR2_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR2_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR2_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR2_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR2_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR2_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR2_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar2_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR2_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR2_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar2_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar2_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR2_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR2_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR2_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar2_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR2_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR2_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar2_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt2 OTGHSHCSPLT2 OTG_HS host channel-2 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT2_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT2_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT2_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT2_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt2_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT2_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT2_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt2_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT2_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT2_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt2_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

