grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_host.h
/** @defgroup otg_hs_host_otg_hs_hcint2 OTGHSHCINT2 OTG_HS host channel-2 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT2_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT2_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT2_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT2_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT2_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT2_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT2_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT2_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT2_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT2_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT2_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT2_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT2_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT2_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT2_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT2_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT2_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT2_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT2_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT2_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT2_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk2 OTGHSHCINTMSK2 OTG_HS host channel-2 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK2_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_BBERRM Babble error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_TXERRM Transaction error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_NYET response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK2_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz2 OTGHSHCTSIZ2 OTG_HS host channel-2 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ2_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz2_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz2_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsizsg2 OTGHSHCTSIZSG2 OTG host channel x transfer size register
@{*/

/** OTG_HS_HOST_OTG_HS_HCTSIZSG2_DOPNG Do ping **/
#define OTG_HS_HOST_OTG_HS_HCTSIZSG2_DOPNG		(1 << 31)

#define OTG_HS_HOST_OTG_HS_HCTSIZSG2_PID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZSG2_PID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsizsg2_pid PID PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG2_NTD_SHIFT		8
#define OTG_HS_HOST_OTG_HS_HCTSIZSG2_NTD_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg2_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG2_SCHED_INFO_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZSG2_SCHED_INFO_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg2_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma2 OTGHSHCDMA2 OTG_HS host channel-2 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA2_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA2_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma2_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdmasg2 OTGHSHCDMASG2 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMASG2_DMASG_SHIFT		3
#define OTG_HS_HOST_OTG_HS_HCDMASG2_DMASG_MASK		0x1fffffff
/** @defgroup otg_hs_host_otg_hs_hcdmasg2_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar3 OTGHSHCCHAR3 OTG_HS host channel-3 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR3_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR3_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR3_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR3_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR3_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR3_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR3_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR3_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar3_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR3_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR3_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar3_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar3_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR3_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR3_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR3_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar3_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar3_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt3 OTGHSHCSPLT3 OTG_HS host channel-3 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT3_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT3_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt3_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt3_hubaddr HUBADDR Hub address
@{*/
/**@}*/


