grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt3_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint3 OTGHSHCINT3 OTG_HS host channel-3 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT3_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT3_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT3_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT3_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT3_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT3_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT3_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT3_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT3_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT3_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT3_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT3_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT3_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT3_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT3_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT3_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT3_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT3_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT3_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT3_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT3_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk3 OTGHSHCINTMSK3 OTG_HS host channel-3 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK3_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_BBERRM Babble error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_TXERRM Transaction error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_NYET response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK3_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz3 OTGHSHCTSIZ3 OTG_HS host channel-3 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ3_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz3_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsizsg3 OTGHSHCTSIZSG3 OTG host channel x transfer size register
@{*/

/** OTG_HS_HOST_OTG_HS_HCTSIZSG3_DOPNG Do ping **/
#define OTG_HS_HOST_OTG_HS_HCTSIZSG3_DOPNG		(1 << 31)

#define OTG_HS_HOST_OTG_HS_HCTSIZSG3_PID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZSG3_PID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsizsg3_pid PID PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG3_NTD_SHIFT		8
#define OTG_HS_HOST_OTG_HS_HCTSIZSG3_NTD_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg3_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG3_SCHED_INFO_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZSG3_SCHED_INFO_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg3_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma3 OTGHSHCDMA3 OTG_HS host channel-3 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA3_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA3_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma3_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdmasg3 OTGHSHCDMASG3 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMASG3_DMASG_SHIFT		3
#define OTG_HS_HOST_OTG_HS_HCDMASG3_DMASG_MASK		0x1fffffff
/** @defgroup otg_hs_host_otg_hs_hcdmasg3_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar4 OTGHSHCCHAR4 OTG_HS host channel-4 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR4_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR4_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR4_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR4_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR4_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR4_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR4_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR4_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar4_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR4_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR4_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar4_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR4_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR4_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar4_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR4_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR4_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR4_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR4_EPDIR		(1 << 15)

