grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCCHAR4_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR4_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar4_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR4_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR4_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar4_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt4 OTGHSHCSPLT4 OTG_HS host channel-4 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT4_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT4_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT4_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT4_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT4_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT4_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt4_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT4_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT4_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt4_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT4_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT4_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt4_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint4 OTGHSHCINT4 OTG_HS host channel-4 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT4_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT4_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT4_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT4_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT4_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT4_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT4_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT4_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT4_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT4_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT4_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT4_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT4_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT4_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT4_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT4_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT4_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT4_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT4_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT4_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT4_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT4_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk4 OTGHSHCINTMSK4 OTG_HS host channel-4 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK4_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_BBERRM Babble error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_TXERRM Transaction error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_NYET response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK4_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK4_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz4 OTGHSHCTSIZ4 OTG_HS host channel-4 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ4_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ4_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz4_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsizsg4 OTGHSHCTSIZSG4 OTG host channel x transfer size register
@{*/

/** OTG_HS_HOST_OTG_HS_HCTSIZSG4_DOPNG Do ping **/
#define OTG_HS_HOST_OTG_HS_HCTSIZSG4_DOPNG		(1 << 31)

#define OTG_HS_HOST_OTG_HS_HCTSIZSG4_PID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZSG4_PID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsizsg4_pid PID PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG4_NTD_SHIFT		8
#define OTG_HS_HOST_OTG_HS_HCTSIZSG4_NTD_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg4_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG4_SCHED_INFO_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZSG4_SCHED_INFO_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg4_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma4 OTGHSHCDMA4 OTG_HS host channel-4 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA4_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA4_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma4_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdmasg4 OTGHSHCDMASG4 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMASG4_DMASG_SHIFT		3
#define OTG_HS_HOST_OTG_HS_HCDMASG4_DMASG_MASK		0x1fffffff
/** @defgroup otg_hs_host_otg_hs_hcdmasg4_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar5 OTGHSHCCHAR5 OTG_HS host channel-5 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR5_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR5_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR5_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR5_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR5_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR5_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR5_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR5_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar5_dad DAD Device address
@{*/
/**@}*/


