grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCTSIZSG7_PID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZSG7_PID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsizsg7_pid PID PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG7_NTD_SHIFT		8
#define OTG_HS_HOST_OTG_HS_HCTSIZSG7_NTD_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg7_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG7_SCHED_INFO_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZSG7_SCHED_INFO_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg7_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma7 OTGHSHCDMA7 OTG_HS host channel-7 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA7_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA7_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma7_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdmasg7 OTGHSHCDMASG7 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMASG7_DMASG_SHIFT		3
#define OTG_HS_HOST_OTG_HS_HCDMASG7_DMASG_MASK		0x1fffffff
/** @defgroup otg_hs_host_otg_hs_hcdmasg7_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar8 OTGHSHCCHAR8 OTG_HS host channel-8 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR8_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR8_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR8_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR8_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR8_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR8_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR8_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR8_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar8_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR8_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR8_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar8_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR8_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR8_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar8_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR8_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR8_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR8_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR8_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR8_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR8_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar8_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR8_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR8_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar8_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt8 OTGHSHCSPLT8 OTG_HS host channel-8 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT8_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT8_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT8_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT8_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt8_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT8_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT8_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt8_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT8_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT8_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt8_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint8 OTGHSHCINT8 OTG_HS host channel-8 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT8_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT8_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT8_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT8_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT8_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT8_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT8_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT8_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT8_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT8_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT8_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT8_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT8_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT8_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT8_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT8_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT8_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT8_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT8_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT8_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT8_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT8_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk8 OTGHSHCINTMSK8 OTG_HS host channel-8 interrupt mask register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINTMSK8_DTERRM Data toggle error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_DTERRM		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_FRMORM Frame overrun mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_FRMORM		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_BBERRM Babble error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_BBERRM		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_TXERRM Transaction error mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_TXERRM		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_NYET response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_ACKM ACK response received/transmitted interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_ACKM		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_NAKM NAK response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_NAKM		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_STALLM STALL response received interrupt mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_STALLM		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_CHHM Channel halted mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_CHHM		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINTMSK8_XFRCM Transfer completed mask **/
#define OTG_HS_HOST_OTG_HS_HCINTMSK8_XFRCM		(1 << 0)

/**@}*/

