grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz10_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz10_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz10_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsizsg10 OTGHSHCTSIZSG10 OTG host channel x transfer size register
@{*/

/** OTG_HS_HOST_OTG_HS_HCTSIZSG10_DOPNG Do ping **/
#define OTG_HS_HOST_OTG_HS_HCTSIZSG10_DOPNG		(1 << 31)

#define OTG_HS_HOST_OTG_HS_HCTSIZSG10_PID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZSG10_PID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsizsg10_pid PID PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG10_NTD_SHIFT		8
#define OTG_HS_HOST_OTG_HS_HCTSIZSG10_NTD_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg10_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG10_SCHED_INFO_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZSG10_SCHED_INFO_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg10_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma10 OTGHSHCDMA10 OTG_HS host channel-10 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA10_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA10_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma10_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdmasg10 OTGHSHCDMASG10 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMASG10_DMASG_SHIFT		3
#define OTG_HS_HOST_OTG_HS_HCDMASG10_DMASG_MASK		0x1fffffff
/** @defgroup otg_hs_host_otg_hs_hcdmasg10_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcchar11 OTGHSHCCHAR11 OTG_HS host channel-11 characteristics register
@{*/

/** OTG_HS_HOST_OTG_HS_HCCHAR11_CHENA Channel enable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR11_CHENA		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCCHAR11_CHDIS Channel disable **/
#define OTG_HS_HOST_OTG_HS_HCCHAR11_CHDIS		(1 << 30)
/** OTG_HS_HOST_OTG_HS_HCCHAR11_ODDFRM Odd frame **/
#define OTG_HS_HOST_OTG_HS_HCCHAR11_ODDFRM		(1 << 29)

#define OTG_HS_HOST_OTG_HS_HCCHAR11_DAD_SHIFT		22
#define OTG_HS_HOST_OTG_HS_HCCHAR11_DAD_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcchar11_dad DAD Device address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR11_MC_SHIFT		20
#define OTG_HS_HOST_OTG_HS_HCCHAR11_MC_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar11_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPTYP_SHIFT		18
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPTYP_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcchar11_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_HOST_OTG_HS_HCCHAR11_LSDEV Low-speed device **/
#define OTG_HS_HOST_OTG_HS_HCCHAR11_LSDEV		(1 << 17)
/** OTG_HS_HOST_OTG_HS_HCCHAR11_EPDIR Endpoint direction **/
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPDIR		(1 << 15)

#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPNUM_SHIFT		11
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPNUM_MASK		0x0f
/** @defgroup otg_hs_host_otg_hs_hcchar11_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_host_otg_hs_hcchar11_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcsplt11 OTGHSHCSPLT11 OTG_HS host channel-11 split control register
@{*/

/** OTG_HS_HOST_OTG_HS_HCSPLT11_SPLITEN Split enable **/
#define OTG_HS_HOST_OTG_HS_HCSPLT11_SPLITEN		(1 << 31)
/** OTG_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT Do complete split **/
#define OTG_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT		(1 << 16)

#define OTG_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_SHIFT		14
#define OTG_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hcsplt11_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_SHIFT		7
#define OTG_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt11_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_MASK		0x7f
/** @defgroup otg_hs_host_otg_hs_hcsplt11_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcint11 OTGHSHCINT11 OTG_HS host channel-11 interrupt register
@{*/

/** OTG_HS_HOST_OTG_HS_HCINT11_DTERR Data toggle error **/
#define OTG_HS_HOST_OTG_HS_HCINT11_DTERR		(1 << 10)
/** OTG_HS_HOST_OTG_HS_HCINT11_FRMOR Frame overrun **/
#define OTG_HS_HOST_OTG_HS_HCINT11_FRMOR		(1 << 9)
/** OTG_HS_HOST_OTG_HS_HCINT11_BBERR Babble error **/
#define OTG_HS_HOST_OTG_HS_HCINT11_BBERR		(1 << 8)
/** OTG_HS_HOST_OTG_HS_HCINT11_TXERR Transaction error **/
#define OTG_HS_HOST_OTG_HS_HCINT11_TXERR		(1 << 7)
/** OTG_HS_HOST_OTG_HS_HCINT11_NYET Response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT11_NYET		(1 << 6)
/** OTG_HS_HOST_OTG_HS_HCINT11_ACK ACK response received/transmitted interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT11_ACK		(1 << 5)
/** OTG_HS_HOST_OTG_HS_HCINT11_NAK NAK response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT11_NAK		(1 << 4)
/** OTG_HS_HOST_OTG_HS_HCINT11_STALL STALL response received interrupt **/
#define OTG_HS_HOST_OTG_HS_HCINT11_STALL		(1 << 3)
/** OTG_HS_HOST_OTG_HS_HCINT11_AHBERR AHB error **/
#define OTG_HS_HOST_OTG_HS_HCINT11_AHBERR		(1 << 2)
/** OTG_HS_HOST_OTG_HS_HCINT11_CHH Channel halted **/
#define OTG_HS_HOST_OTG_HS_HCINT11_CHH		(1 << 1)
/** OTG_HS_HOST_OTG_HS_HCINT11_XFRC Transfer completed **/
#define OTG_HS_HOST_OTG_HS_HCINT11_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcintmsk11 OTGHSHCINTMSK11 OTG_HS host channel-11 interrupt mask register
@{*/

