grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_host.h
/** @defgroup otg_hs_host_otg_hs_hctsizsg15 OTGHSHCTSIZSG15 OTG host channel x transfer size register
@{*/

/** OTG_HS_HOST_OTG_HS_HCTSIZSG15_DOPNG Do ping **/
#define OTG_HS_HOST_OTG_HS_HCTSIZSG15_DOPNG		(1 << 31)

#define OTG_HS_HOST_OTG_HS_HCTSIZSG15_PID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZSG15_PID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsizsg15_pid PID PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG15_NTD_SHIFT		8
#define OTG_HS_HOST_OTG_HS_HCTSIZSG15_NTD_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg15_ntd NTD Number of transfer descriptors
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZSG15_SCHED_INFO_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZSG15_SCHED_INFO_MASK		0xff
/** @defgroup otg_hs_host_otg_hs_hctsizsg15_sched_info SCHEDINFO Schedule information
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hctsiz15 OTGHSHCTSIZ15 OTG_HS host channel-15 transfer size register
@{*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ15_DPID_SHIFT		29
#define OTG_HS_HOST_OTG_HS_HCTSIZ15_DPID_MASK		0x03
/** @defgroup otg_hs_host_otg_hs_hctsiz15_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_SHIFT		19
#define OTG_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_host_otg_hs_hctsiz15_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_host_otg_hs_hctsiz15_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdma15 OTGHSHCDMA15 OTG_HS host channel-15 DMA address register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMA15_DMAADDR_SHIFT		0
#define OTG_HS_HOST_OTG_HS_HCDMA15_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_host_otg_hs_hcdma15_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_host_otg_hs_hcdmasg15 OTGHSHCDMASG15 OTG host channel x DMA address in scatter/gather DMA register
@{*/


#define OTG_HS_HOST_OTG_HS_HCDMASG15_DMASG_SHIFT		3
#define OTG_HS_HOST_OTG_HS_HCDMASG15_DMASG_MASK		0x1fffffff
/** @defgroup otg_hs_host_otg_hs_hcdmasg15_dmasg DMASG DMA scatter/gather information
@{*/
/**@}*/


/**@}*/
